In [1]:
import pandas as pd
import os

## Obtain different dataset data.gov

https://catalog.data.gov/dataset

In [2]:
from six.moves import urllib

# where the datasets will be placed
ROOT_DATA = "../../../ROOT_DATA/data_gov/"

def fetch_data_from_URL(housing_url, file_name, sub_dir="tmp", root_path=ROOT_DATA):
    placement_dir = os.path.join(root_path, sub_dir)
    if not os.path.isdir(placement_dir):
        os.makedirs(placement_dir)
    placement_path = os.path.join(placement_dir, file_name)
    # only download if not already present
    if not os.path.isfile(placement_path):
        urllib.request.urlretrieve(housing_url, placement_path)
    return placement_path

In [3]:
# working with excel: `conda install -c anaconda xlrd`
fsa_xlsx_path = fetch_data_from_URL("https://ifap.ed.gov/fedschcodelist/attachments/1617FedSchoolCodeList.xlsx",
                    "1617FedSchoolCodeList.xlsx", sub_dir="FSA")

In [4]:
s_df = pd.read_excel(fsa_xlsx_path)
s_df.drop('SchoolName', 1, inplace=True)
s_df.drop('Address', 1, inplace=True)
s_df.drop('City', 1, inplace=True)
s_df.drop('Province', 1, inplace=True)
s_df.drop('Country', 1, inplace=True)
print(s_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6962 entries, 0 to 6961
Data columns (total 5 columns):
ID            6962 non-null int64
SchoolCode    6962 non-null object
StateCode     6962 non-null object
ZipCode       6962 non-null int64
PostalCode    229 non-null object
dtypes: int64(2), object(3)
memory usage: 272.0+ KB
None

In [5]:
print(s_df.head())

      ID SchoolCode StateCode  ZipCode PostalCode
0  25969     B04724        DE    19803        NaN
1  25970     B06171        PR      902        NaN
2  25971     B06511        TN    37320        NaN
3  25972     B07022        IL    60610        NaN
4  25973     B07624        OR    97201        NaN

In [6]:
# will set the index to the ID value
s_df.set_index("StateCode").sort_index().head()

              ID SchoolCode  ZipCode PostalCode
StateCode
AK         27243     001065    99801        NaN
AK         30109     011462    99514        NaN
AK         27241     001061    99508        NaN
AK         31676     031603    99664        NaN
AK         27242     001063    99775        NaN

In [7]:
# order is important in this list
n_df = s_df.set_index(["StateCode", "ZipCode"]).sort_index()
n_df.head(10)

                      ID SchoolCode PostalCode
StateCode ZipCode
AK        99507    31180     017066        NaN
          99508    27241     001061        NaN
          99508    31260     017377        NaN
          99514    30109     011462        NaN
          99588    30499     014325        NaN
          99664    31676     031603        NaN
          99669    32248     041386        NaN
          99723    31811     034613        NaN
          99775    27242     001063        NaN
          99801    27243     001065        NaN

In [8]:
# Extracting row
n_df.loc['AK']

            ID SchoolCode PostalCode
ZipCode
99507    31180     017066        NaN
99508    27241     001061        NaN
99508    31260     017377        NaN
99514    30109     011462        NaN
99588    30499     014325        NaN
99664    31676     031603        NaN
99669    32248     041386        NaN
99723    31811     034613        NaN
99775    27242     001063        NaN
99801    27243     001065        NaN

In [9]:
n_df.loc[('AK',99507)]

                      ID SchoolCode PostalCode
StateCode ZipCode
AK        99507    31180     017066        NaN

In [10]:
# value
n_df.loc[('AK',99507), "SchoolCode"]

StateCode  ZipCode
AK         99507      017066
Name: SchoolCode, dtype: object

In [11]:
# series
n_df.loc['AK', "SchoolCode"]

ZipCode
99507    017066
99508    001061
99508    017377
99514    011462
99588    014325
99664    031603
99669    041386
99723    034613
99775    001063
99801    001065
Name: SchoolCode, dtype: object